app/Controllers/Article.php

SELECT *
FROM `tbl_article`
ORDER BY `titre` ASC
---
    public function load_article()
    {
        $articleModel = new ArticleModel();
        $article = $articleModel->orderBy('titre' ,'ASC')->findAll();