app/Controllers/Credit.php

SELECT *
FROM `tbl_client`
WHERE `id` = '1'
 LIMIT 1
---
    public function fetch_credit()
    {
        $creditModel = new CreditModel();
        $clientModel = new ClientModel();
        $credit = $creditModel->getAll();
        foreach ($credit as $row)
        {
            $client = $clientModel->where('id', $row->client_id)->first();